---
kind: method
id: M:Autodesk.Revit.DB.Visual.AssetPropertyList.AddNewAssetPropertyDouble(System.Double)
source: html/daff6e4a-4e2b-dfbf-d6f5-5e493d912243.htm
---
# Autodesk.Revit.DB.Visual.AssetPropertyList.AddNewAssetPropertyDouble Method

Adds a new AssetPropertyDouble containing the input value to this list.

## Syntax (C#)
```csharp
public void AddNewAssetPropertyDouble(
	double value
)
```

## Parameters
- **value** (`System.Double`) - The double value to add.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - The asset property is not editable.